eldoradoel/STM32-Balance-Car/User/upstandingcar.c
***************************************************************/
void SetMotorVoltageAndDirection(s16 s16LeftVoltage, s16 s16RightVoltage)
{
	u16 u16LeftMotorValue;
	u16 u16RightMotorValue;

	if (s16LeftVoltage < 0) // 当左电机PWM输出为负时 PB14设为正 PB15设为负 （PB14 15 分别控制TB6612fng驱动芯片，逻辑0 1可控制左电机正转反转）
	{
		GPIO_SetBits(GPIOB, GPIO_Pin_14);
		GPIO_ResetBits(GPIOB, GPIO_Pin_15);
		s16LeftVoltage = (-s16LeftVoltage);
	}
	else
	{
		GPIO_SetBits(GPIOB, GPIO_Pin_15); // 当左电机PWM输出为正时 PB14设为负 PB15设为正 （PB14 15 分别控制TB6612fng驱动芯片，逻辑0 1可控制左电机正转反转）
		GPIO_ResetBits(GPIOB, GPIO_Pin_14);
		s16LeftVoltage = s16LeftVoltage;
	}

	if (s16RightVoltage < 0)
	{ // 当右电机PWM输出为负时 PB12设为正 PB13设为负 （PB12 13 分别控制TB6612fng驱动芯片，逻辑0 1可控制左电机正转反转）
		GPIO_SetBits(GPIOB, GPIO_Pin_13);
		GPIO_ResetBits(GPIOB, GPIO_Pin_12);
		s16RightVoltage = (-s16RightVoltage);
	}
	else // 当右电机PWM输出为正时 PB12设为负 PB13设为正 （PB12 13 分别控制TB6612fng驱动芯片，逻辑0 1可控制左电机正转反转）
	{
		GPIO_SetBits(GPIOB, GPIO_Pin_12);
		GPIO_ResetBits(GPIOB, GPIO_Pin_13);

		s16RightVoltage = s16RightVoltage;
	}

	u16RightMotorValue = (u16)s16RightVoltage;
	u16LeftMotorValue = (u16)s16LeftVoltage;

	TIM_SetCompare3(TIM2, u16LeftMotorValue);  // TIM2与 u16RightMotorValue对比，不相同则翻转波形，调节PWM占空比
	TIM_SetCompare4(TIM2, u16RightMotorValue); // TIM3与 u16LeftMotorValue对比，不相同则翻转波形，调节PWM占空比

#if 1 /*判断车辆 是否悬停或跌倒，调试用*/

	if (Pitch > 10 || Pitch < -10 & BST_fBluetoothDirectionSR == 0 & BST_fBluetoothDirectionSL == 0)
	{
		TIM_SetCompare3(TIM2, 0);
		TIM_SetCompare4(TIM2, 0);
		stopflag = 1;
	}
	else
		stopflag = 0;

	if (BST_fCarAngle > 50 || BST_fCarAngle < (-50))
	{
		TIM_SetCompare3(TIM2, 0);
		TIM_SetCompare4(TIM2, 0);
		stopflag = 1;
	}
	else
		stopflag = 0;

#endif
}

/***************************************************************
** 函数名称: MotorOutput
** 功能描述: 电机输出函数
			 将直立控制、速度控制、方向控制的输出量进行叠加,并加
			 入死区常量，对输出饱和作出处理。

***************************************************************/
void MotorOutput(void) // 电机PWM输出函数
{
	// 右电机转向PWM控制融合平衡角度、速度输出

	BST_fLeftMotorOut = BST_fAngleControlOut + BST_fSpeedControlOutNew + BST_fBluetoothDirectionNew + Tracing_Speed * 1.02 + Tracing_Direction *1.02; //+directionl - BST_fBluetoothDirectionNew;			//左电机转向PWM控制融合平衡角度、速度输出
	BST_fRightMotorOut = BST_fAngleControlOut + BST_fSpeedControlOutNew - BST_fBluetoothDirectionNew + Tracing_Speed - Tracing_Direction;			   //-directionl+ BST_fBluetoothDirectionNew;			//右电机转向PWM控制融合平衡角度、速度输出

	// BST_fLeftMotorOut = 1000;
	// BST_fRightMotorOut = 1000;

	if ((s16)BST_fLeftMotorOut > MOTOR_OUT_MAX)
		BST_fLeftMotorOut = MOTOR_OUT_MAX;
	if ((s16)BST_fLeftMotorOut < MOTOR_OUT_MIN)
		BST_fLeftMotorOut = MOTOR_OUT_MIN;
	if ((s16)BST_fRightMotorOut > MOTOR_OUT_MAX)
		BST_fRightMotorOut = MOTOR_OUT_MAX;
	if ((s16)BST_fRightMotorOut < MOTOR_OUT_MIN)
		BST_fRightMotorOut = MOTOR_OUT_MIN;

	SetMotorVoltageAndDirection((s16)BST_fLeftMotorOut, (s16)BST_fRightMotorOut);
}

void GetMotorPulse(void) // 采集电机速度脉冲
{
	//////////////////////////////////此部分为外部中断计算脉冲/////////////////////////////////////
	uint16_t u16TempLeft;
	uint16_t u16TempRight;

	u16TempLeft = TIM_GetCounter(TIM3);	 //  TIM3定时器计算调用
	u16TempRight = TIM_GetCounter(TIM4); //	 TIM4定时器计算调用
	leftstop = u16TempLeft;
	rightstop = u16TempRight;
	TIM_SetCounter(TIM3, 0); // TIM3->CNT = 0;
	TIM_SetCounter(TIM4, 0); // TIM4->CNT = 0;   //清零
	BST_s16LeftMotorPulse = u16TempLeft;
	BST_s16RightMotorPulse = (-u16TempRight);

	BST_s32LeftMotorPulseSigma += BST_s16LeftMotorPulse;   // 脉冲值叠加 40ms叠加值
	BST_s32RightMotorPulseSigma += BST_s16RightMotorPulse; // 脉冲值叠加 40ms叠加值
}
/***************************************************************
** 函数名称: SpeedControl
** 功能描述: 速度环控制函数
***************************************************************/

void SpeedControl(void)
{

	BST_fCarSpeed = (BST_s32LeftMotorPulseSigma + BST_s32RightMotorPulseSigma); // * 0.5 ;		  //左右电机脉冲数平均值作为小车当前车速
	BST_s32LeftMotorPulseSigma = BST_s32RightMotorPulseSigma = 0;				// 全局变量 注意及时清零
	BST_fCarSpeedOld *= 0.7;
	BST_fCarSpeedOld += BST_fCarSpeed * 0.3;

	BST_fCarPosition += BST_fCarSpeedOld;	 // 路程  即速度积分	   1/11 3:03
	BST_fCarPosition += BST_fBluetoothSpeed; // 融合蓝牙给定速度
	BST_fCarPosition += fchaoshengbo;		 // 融合超声波给定速度

	BST_fCarPosition += Tracing_Speed; // 融合循迹给定速度

	if (stopflag == 1)
	{
		BST_fCarPosition = 0;
	}

	// 积分上限设限//
	if ((s32)BST_fCarPosition > CAR_POSITION_MAX)
		BST_fCarPosition = CAR_POSITION_MAX;
	if ((s32)BST_fCarPosition < CAR_POSITION_MIN)
		BST_fCarPosition = CAR_POSITION_MIN;

	if (flagbt == 3)
	{
		BST_fCarSpeed_P = 0;
		BST_fCarSpeed_P = (y2 - 128) * 0.46875;
	}
	if (flagbt == 4)
	{
		BST_fCarSpeed_I = 0;
		BST_fCarSpeed_I = (z2 - 192) * 0.15625;
	}

	BST_fSpeedControlOutNew = (BST_fCarSpeedOld - CAR_SPEED_SET) * BST_fCarSpeed_P + (BST_fCarPosition - CAR_POSITION_SET) * BST_fCarSpeed_I; // 速度PI算法 速度*P +位移*I=速度PWM输出
}

/***************************************************************
** 函数名称: BluetoothControl
** 功能描述: 蓝牙控制函数
			 手机发送内容
			 前：0x01    后：0x02
			 左：0x04    右：0x03
			 停止：0x07
			 功能键：（旋转）
			 左旋转:0x05      右旋转：0x06
			 停转：0x07
** 输　入:
** 输　出:
		switch (x)
		{
			case 0x00 : BST_fCarAngle_P=BST_fCarAngle_D=BST_fCarSpeed_P=BST_fCarSpeed_I=0;
			case 0x01 : BST_fBluetoothSpeed =   3000 ;chaoflag=1; break;	   //向前速度 250
			case 0x02 : BST_fBluetoothSpeed = (-3000);chaoflag=1;  break;	   //后退速度 -250
			case 0x03 : BST_fBluetoothDirectionNew= -300; chaoflag=1;break ;//左旋
			case 0x04 : BST_fBluetoothDirectionNew= 300; chaoflag=1;break ;//右旋转
			case 0x05 : BST_fBluetoothDirectionNew= driectionxco; chaoflag=1;break ;//左旋
			case 0x06 : BST_fBluetoothDirectionNew= -driectionxco; chaoflag=1;break ;//右旋转
			case 0x07 : BST_fBluetoothDirectionL  =0; BST_fBluetoothDirectionR = 0; BST_fBluetoothDirectionSL =0; BST_fBluetoothDirectionSR = 0;fchaoshengbo=0;BST_fBluetoothDirectionNew=0;chaoflag=0;   break; //停
			case 0x08 : BST_fBluetoothDirectionSL =0; BST_fBluetoothDirectionSR = 0; fchaoshengbo=0;BST_fBluetoothDirectionNew=0;chaoflag=0;break; //停旋转
			case 0x09 : BST_fBluetoothSpeed =   0 ;  break;
			case 0x0A : flagbt=1;break;
			case 0x0B : flagbt=2;break;
			case 0x0C : flagbt=3;break;
			case 0x0D : flagbt=4;break;
			default : BST_fBluetoothSpeed = 0;flagbt=0; BST_fBluetoothDirectionL=BST_fBluetoothDirectionR = 0;BST_fBluetoothDirectionSR=BST_fBluetoothDirectionSL=0;chaoflag=0;break;
		}

