eldoradoel/STM32-Balance-Car/User/upstandingcar.c
***************************************************************/
int num = 0;
u8 startBit = 0;
int int9num = 0;

void USART3_IRQHandler(void)
{
	u8 uartvalue = 0;

	if (USART_GetFlagStatus(USART3, USART_FLAG_ORE) != RESET) // 注意！不能使用if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)来判断
	{
		USART_ClearFlag(USART3, USART_FLAG_ORE); // 读SR其实就是清除标志
		USART_ReceiveData(USART3);
	}

	if (USART_GetFlagStatus(USART3, USART_FLAG_RXNE) != RESET)
	{
		USART_ClearITPendingBit(USART3, USART_IT_RXNE);

		uartvalue = USART3->DR;
		if (uartvalue == '$')
		{
			startBit = 1;
			num = 0;
		}
		if (startBit == 1)
		{
			inputString[num] = uartvalue;
		}
		if (startBit == 1 && uartvalue == '#')
		{

			newLineReceived = 1;
			startBit = 0;
			int9num = num;
		}
		num++;
		if (num >= 80)
		{
			num = 0;
			startBit = 0;
			newLineReceived = 0;
		}
	}
}

/**********************超声波距离计算***************************/
void chaoshengbo(void)
{
	if (chaoflag == 0)
	{

		juli = TIM_GetCounter(TIM1) * 5 * 34.0 / 200.0;

		if (juli <= 4.00) // 判断若距离小于4cm，小车输出向后PWM值。
		{
			fchaoshengbo = (-300);
		}
		else if (juli >= 5 && juli <= 8.0) // 判断若距离大于5cm，小于8cm，小车输出向前PWM值。
		{
			fchaoshengbo = 500;
		}
		else
		{
			fchaoshengbo = 0; // 距离大于4cm ，超声波PWM输出为0
		}
	}

	// 寄生此上报数据
	// 增加自动上报  10ms进一次，故10*50ms = 500ms
	//  SendAutoUp();
}

/*计算上报的数据*/
void CalcUpData()
{
	float ls, rs, sLence;
	short s_Acc, s_Gyro;
	u16 ad_value;

	if (g_autoup == 1)
	{
		// CLI();
		ls = BST_fLeftMotorOut;
		rs = BST_fRightMotorOut;
		s_Acc = accel[1];
		s_Gyro = gyro[0];
		sLence = juli;
		// SEI();

		dac = (s_Acc / 16384.0f) * 9.8f;
		dgy = ((s_Gyro - 128.1f) / 131.0f);

		ls = ls / 3.91;
		rs = rs / 3.91;

		memset(manydisplay, 0x00, 80);
		memcpy(manydisplay, "$LV", 4);

		memset(lspeed, 0x00, sizeof(lspeed));
		memset(rspeed, 0x00, sizeof(rspeed));
		memset(daccel, 0x00, sizeof(daccel));
		memset(dgyro, 0x00, sizeof(dgyro));
		memset(csb, 0x00, sizeof(csb));
		memset(vi, 0x00, sizeof(vi));

		if ((ls <= 1000) && (ls >= -1000))
			sprintf(lspeed, "%3.2f", ls);
		else
		{
			// sprintf(str,"$AutoUpError!ls=%3.2f#",ls);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		if ((rs <= 1000) && (rs >= -1000))
			sprintf(rspeed, "%3.2f", rs);
		else
		{
			// sprintf(str,"$AutoUpError!rs=%3.2f#",rs);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		if ((dac > -20) && (dac < 20))
			sprintf(daccel, "%3.2f", dac);
		else
		{
			// sprintf(str,"$AutoUpError!dac=%3.2f#",dac);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		if ((dgy > -3000) && (dgy < 3000))
			sprintf(dgyro, "%3.2f", dgy);
		else
		{
			// sprintf(str,"$AutoUpError!dgy=%3.2f#",dgy);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		if ((sLence >= 0) && (sLence < 10000))
			sprintf(csb, "%3.2f", sLence);
		else
		{
			// sprintf(str,"$AutoUpError!juli=%3.2f#",juli);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		ad_value = Get_Adc(0);
		volt = 13.3f * ad_value / 4096.0f - 0.2f;
		if ((volt >= 0) && (volt < 20))
			sprintf(vi, "%3.2f", volt);
		else
		{
			// sprintf(str,"$AutoUpError!volt=%3.2f#",volt);
			// UART3_Send_Char(str); //返回协议数据包
			return;
		}

		strcat(manydisplay, lspeed);
		strcat(manydisplay, ",RV");
		strcat(manydisplay, rspeed);
		strcat(manydisplay, ",AC");
		strcat(manydisplay, daccel);
		strcat(manydisplay, ",GY");
		strcat(manydisplay, dgyro);
		strcat(manydisplay, ",CSB");
		strcat(manydisplay, csb);
		strcat(manydisplay, ",VT");
		strcat(manydisplay, vi);
		strcat(manydisplay, "#");
		memset(updata, 0x00, 80);
		memcpy(updata, manydisplay, 80);
	}
}

/*
自动上报
*/
void SendAutoUp(void)
{
	g_uptimes--;
	if ((g_autoup == 1) && (g_uptimes == 0))
	{
		CalcUpData();
		UART3_Send_Char(updata); // 返回协议数据包
	}
	if (g_uptimes == 0)
		g_uptimes = 5000;
}

int StringFind(const char *pSrc, const char *pDst)
{
	int i, j;
	for (i = 0; pSrc[i] != '\0'; i++)
	{
		if (pSrc[i] != pDst[0])
			continue;
		j = 0;
		while (pDst[j] != '\0' && pSrc[i + j] != '\0')
		{
			j++;
			if (pDst[j] != pSrc[i + j])
				break;
		}
		if (pDst[j] == '\0')
			return i;
	}
	return -1;
}

void CarStateOut(void)
{
	switch (g_newcarstate)
	{
	case enSTOP: // 停止
	{

		BST_fBluetoothSpeed = 0;
		fchaoshengbo = 0;
		BST_fBluetoothDirectionNew = 0;
		chaoflag = 0;
	}
	break;

	case enRUN: // 向前速度 800
	{
		BST_fBluetoothDirectionNew = 0;
		// BST_fSpeedControlOutNew=0;
		BST_fBluetoothSpeed = 400;
		chaoflag = 1;
	}
	break;

	case enLEFT: // 左转
	{

		BST_fBluetoothDirectionNew = -150;
		chaoflag = 1;
	}
	break;

	case enRIGHT: // 右转
	{

		BST_fBluetoothDirectionNew = 150;
		chaoflag = 1;
	}
	break;

	case enBACK: // 后退速度 -800
	{
		BST_fBluetoothDirectionNew = 0;
		// BST_fSpeedControlOutNew=0;
		BST_fBluetoothSpeed = (-400);
		chaoflag = 1;
	}
	break;

	case enTLEFT: // 左旋
	{
		BST_fBluetoothDirectionNew = -driectionxco;
		chaoflag = 1;
	}
	break;
	case enTRIGHT: // 右旋
	{
		BST_fBluetoothDirectionNew = driectionxco;
		chaoflag = 1;
	}
	break;

	default:
		BST_fBluetoothSpeed = 0;
		break; // 停止
	}
}

void ProtocolGetPID(void)
{
	memset(piddisplay, 0x00, sizeof(piddisplay));
	memcpy(piddisplay, "$AP", 4);

	if (BST_fCarAngle_P >= 0 && BST_fCarAngle_P <= 100)
	{
		sprintf(charkp, "%3.2f", BST_fCarAngle_P);
	}
	else
	{
		UART3_Send_Char("$GetPIDError#"); // 返回协议数据包
		return;
	}

	if (BST_fCarAngle_D >= 0 && BST_fCarAngle_D <= 100)
	{
		sprintf(charkd, "%3.2f", BST_fCarAngle_D);
	}
	else
	{
		UART3_Send_Char("$GetPIDError#"); // 返回协议数据包
		return;
	}

	if (BST_fCarSpeed_P >= 0 && BST_fCarSpeed_P <= 100)
	{
		sprintf(charksp, "%3.2f", BST_fCarSpeed_P);
	}
	else
	{
		UART3_Send_Char("$GetPIDError#"); // 返回协议数据包
		return;
	}

	if (BST_fCarSpeed_I >= 0 && BST_fCarSpeed_I <= 100)
	{
		sprintf(charksi, "%3.2f", BST_fCarSpeed_I);
	}
	else
	{
		UART3_Send_Char("$GetPIDError#"); // 返回协议数据包
		return;
	}

	strcat(piddisplay, charkp);
	strcat(piddisplay, ",AD");
	strcat(piddisplay, charkd);
	strcat(piddisplay, ",VP");
	strcat(piddisplay, charksp);
	strcat(piddisplay, ",VI");
	strcat(piddisplay, charksi);
	strcat(piddisplay, "#");

	UART3_Send_Char(piddisplay); // 返回协议数据包
}

