eldoradoel/STM32-Balance-Car/User/upstandingcar.c
void ProtocolCpyData(void)
{
	memcpy(ProtocolString, inputString, num + 1);
	memset(inputString, 0x00, sizeof(inputString));
}
/***************************************************************************
串口协议数据解析
***************************************************************************/
void Protocol(void)
{
	// USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);//禁能接收中断

	// 判断数据包有效性

	switch (ProtocolString[1])
	{
	case run_car:
		g_newcarstate = enRUN;
		UART3_Send_Char(returntemp);
		break;
	case back_car:
		g_newcarstate = enBACK;
		UART3_Send_Char(returntemp);
		break;
	case left_car:
		g_newcarstate = enLEFT;
		UART3_Send_Char(returntemp);
		break;
	case right_car:
		g_newcarstate = enRIGHT;
		UART3_Send_Char(returntemp);
		break;
	case stop_car:
		g_newcarstate = enSTOP;
		UART3_Send_Char(returntemp);
		break;
	default:
		g_newcarstate = enSTOP;
		break;
	}

	/*防止数据丢包*/
	if (strlen((const char *)ProtocolString) < 21)
	{
		newLineReceived = 0;
		memset(ProtocolString, 0x00, sizeof(ProtocolString));
		// USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);//使能接收中断
		UART3_Send_Char("$ReceivePackError#"); // 返回协议数据包
		return;
	}

	if (ProtocolString[3] == '1') // 左摇
	{
		g_newcarstate = enTLEFT;
		UART3_Send_Char(returntemp); // 返回协议数据包
	}

	if (ProtocolString[3] == '2') // 右摇
	{
		g_newcarstate = enTRIGHT;
		UART3_Send_Char(returntemp); // 返回协议数据包
	}

	// 查询PID
	if (ProtocolString[5] == '1')
	{
		ProtocolGetPID();
	}
	else if (ProtocolString[5] == '2') // 恢复默认PID
	{
		ResetPID();
		UART3_Send_Char("$OK#"); // 返回协议数据包
	}

	// 自动上报
	if (ProtocolString[7] == '1')
	{
		g_autoup = 1;
		UART3_Send_Char("$OK#"); // 返回协议数据包
	}
	else if (ProtocolString[7] == '2')
	{
		g_autoup = 0;
		UART3_Send_Char("$OK#"); // 返回协议数据包
	}

	if (ProtocolString[9] == '1') // 角度环更新 $0,0,0,0,1,1,AP23.54,AD85.45,VP10.78,VI0.26#
	{
		//$0,0,0,0,1,1,AP23.54,AD85.45,VP10.78,VI0.26#

		int pos, z;
		char apad[20] = {0}, apvalue[8] = {0}, advalue[8] = {0};

		pos = StringFind((const char *)ProtocolString, (const char *)"AP");
		if (pos == -1)
			return;

		memcpy(apad, ProtocolString + pos, int9num - pos);

		// AP23.54,AD85.45,VP10.78,VI0.26#
		z = StringFind(apad, ",");
		if (z == -1)
			return;
		memcpy(apvalue, apad + 2, z - 2);

		BST_fCarAngle_P = atof(apvalue);

		memset(apad, 0x00, sizeof(apad));
		memcpy(apad, ProtocolString + pos + z + 1, int9num - (pos + z)); // 存储AD后面的数据
		z = StringFind(apad, ",");
		if (z == -1)
			return;
		memcpy(advalue, apad + 2, z - 2);

		BST_fCarAngle_D = atof(advalue);

		UART3_Send_Char("$OK#"); // 返回协议数据包
	}

	if (ProtocolString[11] == '1')
	{
		int pos, z;
		char vpvi[20] = {0}, vpvalue[8] = {0}, vivalue[8] = {0};

		pos = StringFind((const char *)ProtocolString, (const char *)"VP");
		if (pos == -1)
			return;

		memcpy(vpvi, ProtocolString + pos, int9num - pos);
		// y=strchr(apad,'AP');
		// AP23.54,AD85.45,VP10.78,VI0.26#
		z = StringFind(vpvi, ",");
		if (z == -1)
			return;
		memcpy(vpvalue, vpvi + 2, z - 2);

		BST_fCarSpeed_P = atof(vpvalue);

		memset(vpvi, 0x00, sizeof(vpvi));
		memcpy(vpvi, ProtocolString + pos + z + 1, int9num - (pos + z)); // 存储AD后面的数据
		z = StringFind(vpvi, "#");
		if (z == -1)
			return;
		memcpy(vivalue, vpvi + 2, z - 2);

		BST_fCarSpeed_I = atof(vivalue);

		UART3_Send_Char("$OK#"); // 返回协议数据包
	}

	newLineReceived = 0;
	memset(ProtocolString, 0x00, sizeof(ProtocolString));
	// USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);//使能接收中断
}

void SysTick_Handler_ForUpstandingCar()
{
	if (!SquareEnable)
	{ // 收集6050转向角的初始数据，数据稳定需要很长时间
		UpdateCountNum(3500);
		if (TimeToChangeNextStatus())
		{
			SquareEnable = 1;
			MPU6050_Zero = Yaw;
		}
	}
	else
	{
		// 6050运行时间计数
		Tracing_MPU6050Count++;
	}
	if (SquareCountEnable)
	{
		// 延迟池总计数
		Tracing_Count++;
	}
	if (SquareReadyToStop)
	{
		SquareStopCar();
	}
	if (SquareStraight == 1 && SquareReadyToTurn == 0)
	{
		AddSpeed();
	}
}

void ControlCarDoDemo1(void)
{
	if (SquareEnable)
	{
		// 转向结束后状态延迟
		if (SquareStraight == 0 && SquareTurn == 0)
		{
			UpdateCountNum(50);
			SquareLastAngle = ControlCarDoDemoYaw();
			if (TimeToChangeNextStatus())
			{
				SquareStraight = 1;
			}
		}
		// 直走
		if (SquareStraight == 1 && SquareTurn == 0)
		{
			SquareReadyToStraight = 0;
			SquareLastAngle = ControlCarDoDemoYaw();
			if (SquareReadyToTurn)
			{
				if (TimeToChangeNextStatus())
				{
					SquareStraight = 0;
					SquareTurn = 1;
				}
			}
			else
			{
				UpdateCountNum(480);
				ChangeCarToStraight();
				if (TimeToChangeNextStatus())
				{
					ChangeCarToStop();
					UpdateCountNum(200);
					SquareReadyToTurn = 1;
				}
			}
		}
		// 转弯
		if (SquareStraight == 0 && SquareTurn == 1)
		{
			SquareReadyToTurn = 0;
			if (SquareReadyToStraight)
			{
				SquareLastAngle = ControlCarDoDemoYaw();
				if (TimeToChangeNextStatus())
				{
					SquareStraight = 0;
					SquareTurn = 0;
				}
			}
			else
			{
				if (ControlCarDoDemoGetDiffAngle() > 87.0)
				{
					SquareReadyToStraight = 1;
					ChangeCarToStop();
					UpdateCountNum(200);
				}
				else
				{
					ChangeCarToTurn();
				}
			}
		}
	}
}

float ControlCarDoDemoYaw()
{
	return Yaw - MPU6050_Zero + (0.0000234 * Tracing_MPU6050Count * 0.005);
	// return Yaw - MPU6050_Zero;
}

float ControlCarDoDemoGetDiffAngle()
{
	float nowpositionangle = ControlCarDoDemoYaw();
	if (SquareLastAngle > 0.0)
	{
		if (nowpositionangle > 0.0)
		{
			return fabsf(nowpositionangle - SquareLastAngle);
		}
		else
		{
			return -nowpositionangle + SquareLastAngle;
		}
	}
	else
	{
		if (nowpositionangle > 0.0)
		{
			return 360.0 - nowpositionangle + SquareLastAngle;
		}
		else
		{
			return fabsf(nowpositionangle - SquareLastAngle);
		}
	}
}

void ChangeCarToStraight()
{
	SquareReadyToStop = 0;
	Tracing_SpeedPoor = 650;
	Tracing_Direction = 0;
}

void AddSpeed()
{
	if (Tracing_Speed < Tracing_SpeedPoor)
	{
		Tracing_Speed += 5;
	}
}

void ChangeCarToTurn()
{
	SquareReadyToStop = 0;
	Tracing_Speed = 0;
	Tracing_SpeedPoor = 0;
	Tracing_Direction = 200;
}

void ChangeCarToStop()
{
	SquareReadyToStop = 1;
	Tracing_SpeedPoor = 0;
	Tracing_Direction = 0;
}

void SquareStopCar()
{
	if(Tracing_Speed > 0)
	{
		Tracing_Speed = Tracing_Speed -13;
	}
	if (SquareReadyToStraight)
	{
		if(BST_fCarSpeed > 0.0)
		{
			Tracing_Speed = -10;
		}
		else
		{
			Tracing_Speed = 10;
		}
	}
}

void UpdateCountNum(int count)
{
	if (Tracing_CountPoor == 0)
	{
		Tracing_CountPoor = count;
	}
	SquareCountEnable = 1;
}

uint8_t TimeToChangeNextStatus()
{
	if (Tracing_Count >= Tracing_CountPoor)
	{
		SquareCountEnable = 0;
		Tracing_Count = 0;
		Tracing_CountPoor = 0;
		return 1;
	}
	return 0;
}

void ControlCarDoDemo2()
{
	if (SquareEnable)
	{
		if (SquareStraight == 0 && SquareTurn == 0)
		{
			UpdateCountNum(200);
			if (TimeToChangeNextStatus())
			{
				SquareStraight = 1;
			}
		}
		if (SquareStraight == 1 && SquareTurn == 0)
		{
			SquareReadyToStraight = 0;
			if (SquareReadyToTurn)
			{
				if (TimeToChangeNextStatus())
				{
					SquareStraight = 0;
					SquareTurn = 1;
				}
			}
			else
			{
				UpdateCountNum(800);
				ChangeCarToStraight();
				if (TimeToChangeNextStatus())
				{
					ChangeCarToStop();
					UpdateCountNum(200);
					SquareReadyToTurn = 1;
				}
			}
		}
		if (SquareStraight == 0 && SquareTurn == 1)
		{
			SquareReadyToTurn = 0;
			if (SquareReadyToStraight)
			{
				if (TimeToChangeNextStatus())
				{
					SquareStraight = 0;
					SquareTurn = 0;
				}
			}
			else
			{
				UpdateCountNum(150);
				ChangeCarToTurn();
				if (TimeToChangeNextStatus())
				{
					ChangeCarToStop();
					SquareReadyToStraight = 1;
					UpdateCountNum(50);
				}
			}
		}
	}
}
